In [1]:
# if not installed pandas library
!pip install pandas

Requirement already satisfied: pandas in c:\anaconda\lib\site-packages (1.4.4)
Requirement already satisfied: pytz>=2020.1 in c:\anaconda\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: numpy>=1.18.5 in c:\anaconda\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\anaconda\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\anaconda\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [1]:
import pandas as pd
import numpy as np

In [29]:
lst = [1, 2, 3, 4, 5]

In [30]:
type(lst)

list

In [31]:
np_arr = np.array(lst)
np_arr

array([1, 2, 3, 4, 5])

In [32]:
type(np_arr)

numpy.ndarray

In [33]:
# convert lst (list) to pandas Series
pd_ser = pd.Series(lst)
pd_ser   # 1D , 1 row-col

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [34]:
# 2D list creation
twoDlist = [lst, lst, lst]
twoDlist

[[1, 2, 3, 4, 5], [1, 2, 3, 4, 5], [1, 2, 3, 4, 5]]

In [35]:
type(twoDlist)

list

In [36]:
# convert to pandas Series
pd.Series(twoDlist)

0    [1, 2, 3, 4, 5]
1    [1, 2, 3, 4, 5]
2    [1, 2, 3, 4, 5]
dtype: object

In [37]:
# convert to pandas DataFrame
pd.DataFrame(twoDlist)

   0  1  2  3  4
0  1  2  3  4  5
1  1  2  3  4  5
2  1  2  3  4  5

In [38]:
df = pd.DataFrame(twoDlist, columns=['Name', 'Class', 'Roll', 'D', 'E'])
df

   Name  Class  Roll  D  E
0     1      2     3  4  5
1     1      2     3  4  5
2     1      2     3  4  5

In [16]:
type(df)

pandas.core.frame.DataFrame

In [17]:
# to delete dataframe
del df

In [18]:
df

NameError: name 'df' is not defined

In [41]:
df.rename({'Maths': 'sub1', 'Science' : 'sub2' }, axis=index)

   Name  Class  Roll  D  E
0     1      2     3  4  5
1     1      2     3  4  5
2     1      2     3  4  5

In [15]:
Df

   D  E
0  4  5
1  4  5
2  4  5